Revit 2024 API
ConnectorManager.Connectors Property
Return all the Connectors of the Connector Manager.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ConnectorSet Connectors { get; }
Visual Basic
Public ReadOnly Property Connectors As ConnectorSet
	Get
Visual C++
public:
property ConnectorSet^ Connectors {
	ConnectorSet^ get ();
}
Remarks
This property is used to retrieve the Connectors from the Connector Manager.
See Also
ConnectorManager Class
Autodesk.Revit.DB Namespace